In [ ]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

c:\Users\HP\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [12]:
df = pd.read_csv(r"C:\Users\HP\Desktop\ASHFA\data_jobs.csv")

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

# iloc

In [33]:
df.iloc[[1,3],[3,5]]

             job_via  job_work_from_home
1   via BeBee México               False
3  via Diversity.com               False

In [36]:
df.iloc[:5,[6,5]]

        search_location  job_work_from_home
0  Texas, United States               False
1                Mexico               False
2               Germany               False
3  Texas, United States               False
4                 Sudan               False

In [42]:
df.iloc[:2, 8:10]

   job_no_degree_mention  job_health_insurance
0                  False                 False
1                  False                 False

# let's  figure out specific columns in spesific rows

In [23]:
df.loc[:, 'salary_rate':'salary_hour_avg'].dropna(subset='salary_rate') 
 # by iloc method we can only specify column by number

       salary_rate  salary_year_avg  salary_hour_avg
28            year         109500.0              NaN
43            hour              NaN             97.5
51            hour              NaN             72.5
77            year         140000.0              NaN
92            year         120000.0              NaN
...            ...              ...              ...
785624        year         139216.0              NaN
785641        year         150000.0              NaN
785648        year         221875.0              NaN
785682        year         157500.0              NaN
785692        year         157500.0              NaN

[33067 rows x 3 columns]

In [27]:
df.loc[:5][['job_title_short','job_type_skills']]

        job_title_short                                    job_type_skills
0  Senior Data Engineer                                                NaN
1          Data Analyst  {'analyst_tools': ['power bi', 'tableau'], 'pr...
2         Data Engineer  {'analyst_tools': ['dax'], 'cloud': ['azure'],...
3         Data Engineer  {'cloud': ['aws'], 'libraries': ['tensorflow',...
4         Data Engineer  {'cloud': ['oracle', 'aws'], 'other': ['ansibl...
5         Data Engineer  {'cloud': ['gcp'], 'programming': ['python', '...

In [29]:
df.loc[:3,['job_country','job_skills']]

     job_country                                         job_skills
0  United States                                                NaN
1         Mexico  ['r', 'python', 'sql', 'nosql', 'power bi', 't...
2        Germany  ['python', 'sql', 'c#', 'azure', 'airflow', 'd...
3  United States  ['python', 'c++', 'java', 'matlab', 'aws', 'te...